#include <stdio.h>

int main(){
    int n, k, result;
    scanf("%d %d", &n, &k);
    //пробелы для первой строки(вместо чисел, если первая неделя началась не с пн)
    for (int i=1; i<n; i++){
        printf("   ");
    }
    //основной модуль(с числами)
    for (int i=1; i<=k; i++){
        //максимум в строке 7 чисел 
        if (n == 8){
            printf("\n");
            n = 1;
        }
        //разделение для красоты; чтобы все числа находились друг под другом(работает только для одно- и дву- значных чисел)
        if (i/10!= 0){
            printf("%d ", i);
        } else{
            printf(" %d ", i);
        }

        n += 1;
    }

    printf("\n");
    return 0;
}